#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.repository_lib_template["rust"].github_repository_file.files[".env.base"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .env.base - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-lib/.env.base.tftpl
            
            DOCKER_NAME=arrow-lib-template-rust
            PACKAGE_NAME=lib-template-rust
            PUBLISH_PACKAGE_NAME=lib-template-rust
        EOT
      + file                = ".env.base"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-template-rust"
      + sha                 = (known after apply)
    }

  # module.repository_lib_template["rust"].github_repository_file.files[".env.base.tftpl"] will be destroyed
  # (because key [".env.base.tftpl"] is not in for_each map)
  - resource "github_repository_file" "files" {
      - branch              = "develop" -> null
      - commit_message      = "chore(ci): .env.base.tftpl - provisioned by terraform" -> null
      - commit_sha          = "29aa1476ad1742891d2350d553fbf804ec0b4dbd" -> null
      - content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-lib/.env.base.tftpl
            
            DOCKER_NAME=arrow-lib-template-rust
            PACKAGE_NAME=lib-template-rust
            PUBLISH_PACKAGE_NAME=lib-template-rust
        EOT -> null
      - file                = ".env.base.tftpl" -> null
      - id                  = "lib-template-rust/.env.base.tftpl" -> null
      - overwrite_on_create = true -> null
      - repository          = "lib-template-rust" -> null
      - sha                 = "17c202772616a0f6939479d145998544beccab4c" -> null
    }

  # module.repository_rust_lib["router"].github_repository_file.files[".env.base"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .env.base - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-lib/.env.base.tftpl
            
            DOCKER_NAME=arrow-lib-router
            PACKAGE_NAME=lib-router
            PUBLISH_PACKAGE_NAME=lib-router
        EOT
      + file                = ".env.base"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-router"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["router"].github_repository_file.files[".env.base.tftpl"] will be destroyed
  # (because key [".env.base.tftpl"] is not in for_each map)
  - resource "github_repository_file" "files" {
      - branch              = "develop" -> null
      - commit_message      = "chore(ci): .env.base.tftpl - provisioned by terraform" -> null
      - commit_sha          = "332c6248cb6af0bf540cba9b2722deb8b0144077" -> null
      - content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-lib/.env.base.tftpl
            
            DOCKER_NAME=arrow-lib-router
            PACKAGE_NAME=lib-router
            PUBLISH_PACKAGE_NAME=lib-router
        EOT -> null
      - file                = ".env.base.tftpl" -> null
      - id                  = "lib-router/.env.base.tftpl" -> null
      - overwrite_on_create = true -> null
      - repository          = "lib-router" -> null
      - sha                 = "125df3e5666fbafb1c82df43dafd74a52129e871" -> null
    }

Plan: 2 to add, 0 to change, 2 to destroy.

```

</details>

*Pusher: @ServiceDog, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*